{
  "backend/main.mo": "Motoko actor managing user profiles and movie projects with permission checks, storage maps, and CRUD operations.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON summary mapping frontend file paths to brief functional descriptions for build analysis.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining prerequisites and steps for deploying the app locally and to mainnet.",
  "frontend/index.css": "Tailwind-based global styles defining light/dark themes with OKLCH color variables.",
  "frontend/index.html": "HTML entry point setting the page title and loading the main React bundle.",
  "frontend/src/App.tsx": "Main React app layout handling authentication, project context, workspace tabs, and global UI structure.",
  "frontend/src/features/assembly/AssemblyPanel.tsx": "Assembly editor providing timeline management, scene ordering, audio integration, and playback controls.",
  "frontend/src/features/assembly/useAssemblyPlayback.ts": "React hook managing playback timing and scene tracking for timeline-based or music‑video assemblies with optional audio element syncing.",
  "frontend/src/features/assembly/useLocalAudio.ts": "Manages selection, URL creation, and cleanup of a locally chosen audio file.",
  "frontend/src/features/assets/BrandLogo.tsx": "Renders the app’s logo image and title text.",
  "frontend/src/features/assets/RoleIcon.tsx": "Displays a role-specific icon by cropping from a sprite sheet based on predefined coordinates.",
  "frontend/src/features/auth/LoginButton.tsx": "Shows a sign‑in/sign‑out button using Internet Identity and handles auth transitions with query cache clearing.",
  "frontend/src/features/auth/ProfileSetupDialog.tsx": "Dialog for entering and saving a user’s name during initial profile setup.",
  "frontend/src/features/auth/useCurrentUser.ts": "Combines Internet Identity state with the fetched user profile to expose current user info.",
  "frontend/src/features/export/ExportButtons.tsx": "UI dropdown for exporting the current project as text or JSON with success/error toasts.",
  "frontend/src/features/export/exportProject.ts": "Generates text or JSON exports of a project, formats sections, and triggers browser file downloads.",
  "frontend/src/features/layout/StudioLayout.tsx": "Provides the main page layout with header, footer, and content region including a publish help dialog.",
  "frontend/src/features/projects/components/ProjectSwitcher.tsx": "Dropdown UI for switching, creating, saving, and deleting projects with a confirmation dialog.",
  "frontend/src/features/projects/localDraftStorage.ts": "Handles saving, loading, migrating, and clearing localStorage project drafts with versioning.",
  "frontend/src/features/projects/useProjects.ts": "React hook managing project state, syncing anonymous drafts with backend CRUD operations and local storage. Handles creating, updating, deleting, and switching movie projects.",
  "frontend/src/features/publish/PublishHelpDialog.tsx": "UI dialog providing step-by-step instructions for deploying the app to the Internet Computer. Includes prerequisites and local deployment guidance.",
  "frontend/src/features/workspace/components/ProjectOutlinePanel.tsx": "Panel for editing a project's outline including title, logline, characters, locations, and scenes. Supports adding, updating, and deleting outline elements.",
  "frontend/src/features/workspace/components/PromptEntryEditor.tsx": "Dialog for creating or editing role prompt entries with template support and element targeting. Manages form state and submits structured prompt data.",
  "frontend/src/features/workspace/components/RolePromptBoard.tsx": "Board for browsing, filtering, adding, editing, deleting, and copying role-specific prompts in a project. Integrates with project state and opens the prompt editor dialog.",
  "frontend/src/features/workspace/promptTemplates.ts": "Defines prompt template structures and a preset list of director, screenwriter, cinematographer, and producer prompts for project guidance.",
  "frontend/src/features/workspace/roles.ts": "Lists production roles and provides short descriptions for each role.",
  "frontend/src/features/workspace/state/projectDraft.ts": "Implements helper functions to create and mutate a ProjectDraft, including characters, locations, scenes, prompts, and assembly timeline reconciliation.",
  "frontend/src/features/workspace/types.ts": "Declares TypeScript interfaces for project elements such as characters, locations, prompts, timeline items, and the overall ProjectDraft.",
  "frontend/src/features/workspace/utils/formatPromptForClipboard.ts": "Formats a role prompt into a markdown-style string for clipboard copying.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and movie projects through the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light/dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and Internet Identity providers and mounts it to the DOM.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear them from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for the app’s UI theme.",
  "project_state.json": "Describes the project’s overall state, features, architecture notes, and metadata for the movie production app."
}